app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order("created_at desc").paginate(page: params[:page], per_page: 2)
---
SELECT  "posts".* FROM "posts"  ORDER BY created_at desc LIMIT 2 OFFSET 0