app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    if params[:search]
      @posts = Post.search(params[:search]).order("created_at DESC").paginate(page: params[:page], per_page: 5)
---
SELECT "posts".* FROM "posts" WHERE (content ILIKE '%test%')  ORDER BY created_at DESC
SELECT  "posts".* FROM "posts" WHERE (content LIKE '%test%')  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def create
  	@post = Post.new post_params
  	if @post.save
---
INSERT INTO "posts" ("title", "content", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "3rd Post"], ["content", "This is the third post"], ["slug", "3rd-post"], ["created_at", "2015-11-14 16:51:04.116501"], ["updated_at", "2015-11-14 16:51:04.116501"]]

  def show
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def update
    if @post.update post_params
---
UPDATE "posts" SET "link" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["link", "https://www.youtube.com/watch?v=QrhnJF85xXA"], ["updated_at", "2015-12-29 01:23:08.693101"], ["id", 5]]

  def find_post
    @post = Post.friendly.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]