app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"  ORDER BY created_at desc
---
  def index
  	@projects = Project.all.order("created_at desc")

INSERT INTO "projects" ("title", "description", "link", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
  	@project = Project.new project_params

  	if @project.save

UPDATE "projects" SET "link" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["link", "http://www.facebook.com"], ["updated_at", "2015-12-05 16:19:40.908345"], ["id", 1]]
---
  def update
    if @project.update project_params

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_project
    @project = Project.friendly.find(params[:id])