app/controllers/users_controller.rb

  def update
  	if @user.update user_params
---
UPDATE "users" SET "about" = ?, "updated_at" = ? WHERE "users"."id" = ?

  def find_user
    @user = User.find(1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]