app/controllers/videos_controller.rb

SELECT  "videos".* FROM "videos"  ORDER BY created_at DESC LIMIT 5 OFFSET 0
---
  def index
    @videos = Video.all.order('created_at DESC').paginate(page: params[:page], per_page: 5)

INSERT INTO "videos" ("title", "description", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test Video "], ["description", "This is a test video "], ["link", "link.com"], ["created_at", "2015-11-22 18:40:33.323192"], ["updated_at", "2015-11-22 18:40:33.323192"]]
---
  def create
    @video = Video.new video_params
    if @video.save

UPDATE "videos" SET "link" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["link", "https://www.youtube.com/watch?v=OHXjxWaQs9o"], ["updated_at", "2015-11-22 18:45:30.996172"], ["id", 1]]
---
  def update
    if @video.update video_params

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_video
    @video = Video.find(params[:id])