app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts"  ORDER BY created_at desc LIMIT 3
SELECT  "projects".* FROM "projects"  ORDER BY created_at desc LIMIT 3
SELECT  "videos".* FROM "videos"  ORDER BY created_at desc LIMIT 3
---
  def index
  	@user = User.find(1)
  	@posts = Post.all.limit(3).order("created_at desc")
  	@projects = Project.all.limit(3).order("created_at desc")
  	@videos = Video.all.limit(3).order("created_at desc")